Postgres/dist-storage/dremios3-summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
Query 15,1,13499,13499,13499,0.00,0.000%,.07408,0.13,0.00,1860.0
query 17,1,12971,12971,12971,0.00,0.000%,.07710,0.03,0.00,346.0
Query 26,1,2914,2914,2914,0.00,0.000%,.34317,0.01,0.00,30.0
Oracle 28,1,90484,90484,90484,0.00,0.000%,.01105,0.00,0.00,308.0
query 30,1,7542,7542,7542,0.00,0.000%,.13259,0.05,0.00,362.0
query 45,1,7198,7198,7198,0.00,0.000%,.13893,0.00,0.00,24.0
TOTAL,6,22434,2914,90484,30646.16,0.000%,.04457,0.02,0.00,488.3